In [41]:
import pandas as pd
import numpy as np

In [42]:
df = pd.DataFrame()

In [43]:
df['1'] = [1,2,3]

In [44]:
df['2'] = [4,5,6]

In [45]:
df

   1  2
0  1  4
1  2  5
2  3  6

In [46]:
df2 = pd.DataFrame()

In [47]:
df2['1'] = [2]

In [48]:
df2['2'] = [4]

In [78]:
import time
start_time = time.time()
df3 = pd.DataFrame(columns=['1','2'])
dic = {}
for i in range(0,len(df)):
    df3 = df.iloc[0:len(df)]*df2.iloc[0]

In [79]:
df3

   1   2
0  2  16
1  4  20
2  6  24